{
  "filename": "faq.md",
  "__html": "<h1>FAQ</h1>\n<p><a href=\"#1\" target=\"_self\">1.Can Seata be used in a production environment?</a></p>\n<p><a href=\"#2\" target=\"_self\">2.Dose Seata support high availability ?</a></p>\n<p><a href=\"#3\" target=\"_self\">3.What is the use of the record of undo log table log status = 1 ?</a></p>\n<p><a href=\"#4\" target=\"_self\">4.How to use the Seata framework to ensure transaction isolation?</a></p>\n<p><a href=\"#5\" target=\"_self\">5.When Failed to roll back dirty data, what shall I do ?</a></p>\n<p><a href=\"#6\" target=\"_self\">6.Why the global transaction state is not &quot;begin&quot; when a branch transaction is registered ?</a></p>\n<p><a href=\"#7\" target=\"_self\">7.When Nacos is used as the Seata configuration center, the project startup error report cannot find the service. How to check and deal with it ?</a></p>\n<p><a href=\"#8\" target=\"_self\">8.When Eureka is the registry and TC is highly available, how to overwrite Eureka properties at the TC end?</a></p>\n<p><a href=\"#9\" target=\"_self\">9.java.lang.NoSuchMethodError: com.fasterxml.jackson.databind.jsontype.TypeSerializer.typeId(Ljava/lang/Object;Lcom/fasterxml/jackson/core/JsonToken;)?</a></p>\n<p><a href=\"#10\" target=\"_self\">10. Why didn't my mybatis operation return auto-generated ID? </a></p>\n<p><a href=\"#11\" target=\"_self\">11.I can't find this package:io.seata.codec.protobuf.generated,and cant't run seata server?</a></p>\n<hr>\n<h3 id='1'>Q: 1.Can Seata be used in a production environment?</h3>\n<p><strong>A:</strong>\nSince version 0.4.2,it is supported in production environment,Users who are using seata are welcome to complete this issue together:<a href=\"https://github.com/seata/seata/issues/1246\">who's using Seata</a></p>\n<hr>\n<h3 id='2'>Q: 2.Dose Seata support high availability ?</h3>\n<p><strong>A:</strong>\nsupported from version 0.6, tc USES db mode to share global transaction session information, and the registry USES non-file seata-supported third-party registries</p>\n<hr>\n<h3 id='3'>Q: 3.What is the use of the record of undo log table log status = 1 ?</h3>\n<p><strong>A:</strong></p>\n<p><strong>Scenario:</strong>  after A branch transaction A registers TC, A global transaction rollback occurs before A local transaction commits</p>\n<p><strong>Consequence:</strong> global transaction rollback succeeds, a resource is occupied, resulting in resource suspension problem</p>\n<p><strong>Anti-suspension measures:</strong> when a rolls back and finds that the rollback undo has not been inserted, an undo record with log_status=1 is inserted. When a local transaction (business write operation SQL and corresponding undo are a local transaction) is committed, it fails due to the primary key conflict of the undo table.</p>\n<hr>\n<h3 id='4'>Q: 4.How to use the Seata framework to ensure transaction isolation?</h3>\n<p><strong>A:</strong>\nSince seata phase 1 local transactions have been committed, enhanced isolation is needed to prevent other transactions from dirty reads and dirty writes.</p>\n<ol>\n<li>Dirty read Select statement with for update, proxy method with @GlobalLock or @GlobalTransaction</li>\n<li>Dirty write You must use @globaltransaction\nnote：If the interface of the business you are querying does not use the @globaltransactional annotation, which means there is no need for distributed transactions on the method, you can annotate the @globallock annotation on the method and add a for update statement to the query.\nIf your query interface has the @globaltransactional annotation on the outer edge of the transactional link, you can simply add a for update statement to your query. The reason for designing this annotation is that before it is available, distributed transactions need to query the committed data, but the business does not need distributed transactions.\nUsing the GlobalTransactional annotation adds some unnecessary additional RPC overhead such as begin returning xid, commit transaction, etc. GlobalLock simplifies the RPC process for higher performance.</li>\n</ol>\n<hr>\n<h3 id='5'>Q: 5.When Failed to roll back dirty data, what shall I do ?</h3>\n<p><strong>A:</strong></p>\n<ol>\n<li>The dirty data needs to be processed manually, and the data can be corrected according to the log prompt, or the corresponding undo can be deleted (the FailureHandler can be customized for email notification or other purposes).</li>\n<li>This option is not recommended when &quot;undo&quot; mirror validation is turned off during rollback.\nnode：It is recommended to isolate the dirty data in advance</li>\n</ol>\n<hr>\n<h3 id='6'>Q: 6.Why the global transaction state is not \"begin\" when a branch transaction is registered ?</h3>\n<p><strong>A:</strong></p>\n<p><strong>abnormal：</strong> Could not register branch into global session xid = status = Rollbacked（Two phase state and Rollbacking, AsyncCommitting, etc） while expecting Begin</p>\n<p><strong>describe：</strong> When a branch transaction is registered, the global transaction status must be a one-phase state &quot;begin&quot;, and registration other than &quot;begin&quot; is not allowed. It belongs to the normal processing at the seata framework level, and users can solve it from their own business level.</p>\n<p>This exception can occur in the following situations (you can continue to add).</p>\n<ol>\n<li>The branch transaction is asynchronous. The global transaction is not aware of its progress. The global transaction has entered phase 2 before the asynchronous branch comes to register.</li>\n<li>Service a rpc service b timed out (dubbo, feign, etc. timeout by default for 1 second), a throws an exception to tm, tm informs tc to roll back, but b still receives the request (network delay or rpc framework retry), and then registers at tc Global transaction was found to be rolling back.</li>\n<li>Tc is aware of the global transaction timeout (@globaltransactional (timeoutMills = default 60 seconds)), actively changes the state and notifies each branch transaction to rollback when a new branch transaction is registered.</li>\n</ol>\n<hr>\n<h3 id='7'>Q: 7.When Nacos is used as the Seata configuration center, the project startup error report cannot find the service. How to check and deal with it ?</h3>\n<p><strong>A:</strong>\nabnormal：io.seata.common.exception.FrameworkException: can not register RM,err:can not connect to services-server.</p>\n<ol>\n<li>Check the nacos configuration list to see if the seata configuration has been imported successfully.</li>\n<li>Check the list of nacos services to see if serverAddr has been registered successfully.</li>\n<li>Check the namespace, registry.nacos.namespace and config.nacos.namespace in the client's registry.conf and enter the nacos namespace ID. The default is &quot;&quot;. The server and client correspond to the namespace.\nIt is public and is a reserved control of nacos. If you need to create your own namespace, it is better not to use the same name as public, and use a name that has specific semantics in an actual business scenario.</li>\n<li>For the list of services on nacos, the IP address corresponding to serverAddr address should be the IP address specified for seata startup, such as: sh seata-server.sh-p 8091-h 122.51.204.197-m file.</li>\n<li>Check to see if the seata/conf/nacos-config.txt, transaction group service.vgroup_mapping.trade_group=default configuration is the same as the project group configuration name.</li>\n<li>Telnet IP port view ports are open as well as firewall status.\nnote：1.Version 080 starts the specified IP problem, the exception &quot;Exception in thread &quot;main&quot; java.lang.RuntimeException: java.net.BindException: Cannot assign request address&quot;, please upgrade to version 081 or above.\nThe project USES jdk13 and starts with</li>\n</ol>\n<pre><code class=\"language-verilog\">   Error: Could <span class=\"hljs-keyword\">not</span> create the Java Virtual Machine\n   Error: A fatal exception has occurred. Program will exit.\n</code></pre>\n<p>​    If the environment is sh, replace the last paragraph in the script：</p>\n<pre><code class=\"language-shell\">        exec \"$JAVACMD\" $JAVA_OPTS -server -Xmx2048m -Xms2048m -Xmn1024m -Xss512k -XX:SurvivorRatio=10 -XX:MetaspaceSize=128m -XX:MaxMetaspaceSize=256m -XX:\nMaxDirectMemorySize=1024m -XX:-OmitStackTraceInFastThrow -XX:-UseAdaptiveSizePolicy -XX:+HeapDumpOnOutOfMemoryError -XX:HeapDumpPath=\"$BASEDIR\"/logs\n/java_heapdump.hprof -XX:+DisableExplicitGC -XX:+CMSParallelRemarkEnabled -XX:+\nUseCMSInitiatingOccupancyOnly -XX:CMSInitiatingOccupancyFraction=75 -verbose:gc -Dio.netty.leakDetectionLevel=advanced \\\n          -classpath \"$CLASSPATH\" \\\n          -Dapp.name=\"seata-server\" \\\n          -Dapp.pid=\"$$\" \\\n          -Dapp.repo=\"$REPO\" \\\n          -Dapp.home=\"$BASEDIR\" \\\n          -Dbasedir=\"$BASEDIR\" \\\n          io.seata.server.Server \\\n          \"$@\"\n</code></pre>\n<hr>\n<h3 id='8'>Q: 8.When Eureka is the registry and TC is highly available, how to overwrite Eureka properties at the TC end?</h3>\n<p><strong>A:</strong>\nAdd the eureka-client.properties file in the seata\\conf directory and add the Eureka properties to be overwritten.\nFor example, to overwrite eureka.instance.lease-renewal-interval-in-seconds and eureka.instance.lease-expiration-duration-in-seconds, add the following:</p>\n<pre><code class=\"language-java\">eureka.lease.renewalInterval=<span class=\"hljs-number\">1</span>  \neureka.lease.duration=<span class=\"hljs-number\">2</span>\n</code></pre>\n<p>The attribute prefix is eureka, and the subsequent attribute names can refer to the class com.netflix.appinfo.PropertyBasedInstanceConfigConstants. You can also study the seata-discovery-eureka project of the discovery module in the seata source code.</p>\n<hr>\n<h3 id='9'>Q: 9.What's the reason of java.lang.NoSuchMethodError: com.fasterxml.jackson.databind.jsontype.TypeSerializer.typeId(Ljava/lang/Object;Lcom/fasterxml/jackson/core/JsonToken;) ?</h3>\n<p><strong>A:</strong>\nwhen the undolog serialization is configured as Jackson, the Jackson version needs to be 2.9.9+</p>\n<hr>\n<h3 id='10'>Q: 10. Why didn't my mybatis operation return auto-generated ID? </h3>\n<p><strong>A:</strong>\nYou should update the configuraton of <code>mybatis</code>:  set annotation <code>@Options(useGeneratedKeys = true, keyProperty = &quot;id&quot;)</code> or set the value of useGeneratedKeys and keyProperty  in <code>mybatis</code> xml configuraton</p>\n<hr>\n<h3 id='11'>Q: 11.I can't find this package:io.seata.codec.protobuf.generated,and cant't run seata server?</h3>\n<p><strong>A:</strong>\nYou can execute this command:mvn clean install -DskipTests=true,These codes have been removed in version 0.8.1.</p>\n<hr>\n",
  "link": "/en-us/docs/overview/faq.html",
  "meta": {
    "title": "Seata FAQ",
    "keywords": "Seata",
    "description": "Seata FAQ."
  }
}