{
  "filename": "manual-transaction-mode.md",
  "__html": "<h1>Manual Transaction Mode</h1>\n<p>Review the description in the overview: a distributed global transaction, the whole is a model of <strong>the two-phase commit</strong>. A global transaction consists of several branch transactions that meet the model requirements of <strong>the two-phase commit</strong>, which requires each branch transaction to have its own:</p>\n<ul>\n<li>One phase prepare behavior</li>\n<li>Two phase commit or rollback behavior</li>\n</ul>\n<p><img src=\"https://upload-images.jianshu.io/upload_images/4420767-e48f0284a037d1df.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" alt=\"Overview of a global transaction\"></p>\n<p>According to the two phase behavior pattern，We divide the branch transaction into <strong>Automatic (Branch) Transaction Mode</strong> and <strong>Manual (Branch) Transaction Mode</strong>.</p>\n<p>The AT mode（<a href=\"\">Reference Link TBD</a>）is based on the <strong>Relational Database</strong> that <strong>supports local ACID transactions</strong>：</p>\n<ul>\n<li>One phase prepare behavior: In the local transaction, the business data update and the corresponding rollback log record are submitted together.</li>\n<li>Two phase commit behavior: Immediately ended successfully, <strong>Auto</strong> asynchronous batch cleanup of the rollback log.</li>\n<li>Two phase rollback behavior: By rolling back the log, <strong>automatic</strong> generates a compensation operation to complete the data rollback.</li>\n</ul>\n<p>Accordingly, the MT mode does not rely on transaction support for the underlying data resources:</p>\n<ul>\n<li>One phase prepare behavior: Call the prepare logic of <strong>custom</strong> .</li>\n<li>Two phase commit behavior:Call the commit logic of <strong>custom</strong> .</li>\n<li>Two phase rollback behavior:Call the rollback logic of <strong>custom</strong> .</li>\n</ul>\n<p>The so-called MT mode refers to the support of the branch transaction of <strong>custom</strong> into the management of global transactions.</p>\n",
  "link": "/en-us/blog/manual-transaction-mode.html",
  "meta": {
    "title": "MT mode",
    "keywords": "MT mode",
    "description": "introduce MT mode",
    "author": "kmmshmily",
    "date": "2019-02-13"
  }
}