{
  "filename": "what_is_dragonfly.md",
  "__html": "<h1>What Is Dragonfly?</h1>\n<p>Dragonfly is an intelligent P2P-based image and file distribution tool. It aims to improve the efficiency and success rate of file transferring, and maximize the usage of network bandwidth, especially for the distribution of larget amounts of data, such as application distribution, cache distribution, log distribution, and image distribution.</p>\n<p>At Alibaba, every month Dragonfly is invoked two billion times and distributes 3.4PB of data. Dragonfly has become one of the most important pieces of infrastructure at Alibaba.</p>\n<p>While container technologies makes DevOps life easier most of the time, it surely brings some challenges: for example the efficiency of image distribution, especially when you have to replicate image distribution on several hosts.</p>\n<p>Dragonfly works extremely well with both Docker and <a href=\"https://github.com/alibaba/pouch\">PouchContainer</a> in this scenario. It's also compatible with containers of other formats. It delivers up to 57 times the throughput of native docker and saves up to 99.5% of the out bandwidth of registry.</p>\n<p>Dragonfly makes it simple and cost-effective to set up, operate, and scale any kind of file, image, or data distribution.</p>\n<h2>Why Dragonfly</h2>\n<p>This project is an open-source version of the Dragonfly used at Alibaba. It has the following features:</p>\n<p><strong>Note:</strong> More Alibaba-internal features will be made available to open-source users soon. Stay tuned!</p>\n<ul>\n<li><strong>P2P-based file distribution</strong>: By using the P2P technology for file transmission, it makes the most out of the bandwidth resources of each peer to improve downloading efficiency,  and saves a lot of cross-IDC bandwidth, especially the costly cross-board bandwidth.</li>\n<li><strong>Non-invasive support to all kinds of container technologies</strong>: Dragonfly can seamlessly support various containers for distributing images.</li>\n<li><strong>Host level speed limit</strong>: In addition to rate limit for the current download task like many other downloading tools (for example wget and curl), Dragonfly also provides rate limit for the entire host.</li>\n<li><strong>Passive CDN</strong>: The CDN mechanism can avoid repetitive remote downloads.</li>\n<li><strong>Strong consistency</strong>: Dragonfly can make sure that all downloaded files are consistent even if users do not provide any check code (MD5).</li>\n<li><strong>Disk protection and highly efficient IO</strong>: Prechecking disk space, delaying synchronization, writing file blocks in the best order, isolating net-read/disk-write, and so on.</li>\n<li><strong>High performance</strong>: Cluster Manager is completely closed-loop, which means that it doesn't rely on any database or distributed cache, processing requests with extremely high performance.</li>\n<li><strong>Auto-isolation of Exception</strong>: Dragonfly will automatically isolate exception nodes (peer or Cluster Manager) to improve download stability.</li>\n<li><strong>No pressure on file source</strong>: Generally, only a few Cluster Managers will download files from the source.</li>\n<li><strong>Support standard HTTP header</strong>: Support submitting authentication information through HTTP header.</li>\n<li><strong>Effective concurrency control of Registry Auth</strong>: Reduce the pressure on the Registry Auth Service.</li>\n<li><strong>Simple and easy to use</strong>: Very few configurations are needed.</li>\n</ul>\n<h2>How Does It Stack Up Against Traditional Solution?</h2>\n<p>We carried out an experiment to compare the performance of Dragonfly and wget.</p>\n<table>\n<thead>\n<tr>\n<th>Test Environment</th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Dragonfly Server</td>\n<td>2 * (24-Core 64GB-RAM 2000Mb/s)</td>\n</tr>\n<tr>\n<td>File Source Server</td>\n<td>2 * (24-Core 64GB-RAM 2000Mb/s)</td>\n</tr>\n<tr>\n<td>Client</td>\n<td>4-Core 8GB-RAM 200Mb/s</td>\n</tr>\n<tr>\n<td>Target File Size</td>\n<td>200MB</td>\n</tr>\n<tr>\n<td>Experiment Date</td>\n<td>April 20, 2016</td>\n</tr>\n</tbody>\n</table>\n<p>The expeirment result is as shown in the following figure.</p>\n<p><img src=\"../img/performance.png\" alt=\"How it stacks up\"></p>\n<p>As you can see in the chart, for Dragonfly, no matter how many clients are downloading, the average downloading time is always about 12 seconds. But for wget, the downloading time keeps increasing with the number of clients. When the number of wget clients reaches 1,200, the file source crashed and therefore cannot serve any client.</p>\n<h2>How Does It Work?</h2>\n<p>Dragonfly works slightly differently when downloading general files and downloading container images.</p>\n<h3>Downloading General Files</h3>\n<p>The Cluster Manager is also called a SuperNode, which is responsible for CDN and scheduling every peer to transfer blocks between each other. dfget is the P2P client, which is also called &quot;peer&quot;. It's mainly used to download and share blocks.</p>\n<p><img src=\"../img/dfget.png\" alt=\"Downloading General Files\"></p>\n<h3>Downloading Container Images</h3>\n<p>Registry is similar to the file server above. dfget proxy is also called dfdaemon, which intercepts HTTP requests from docker pull or docker push, and then decides which requests to process with dfget.</p>\n<p><img src=\"../img/dfget-combine-container.png\" alt=\"Downloading Container Images\"></p>\n<h3>Downloading Blocks</h3>\n<p>Every file is divided into multiple blocks, which are transmitted between peers. Each peer is a P2P client. Cluster Manager will check if the corresponding file exists in the local disk. If not, it will be downloaded into Cluster Manager from file server.</p>\n<p><img src=\"../img/distributing.png\" alt=\"How file blocks are downloaded\"></p>\n",
  "link": "/zh-cn/docs/overview/what_is_dragonfly.html",
  "meta": {}
}